20260824/20260824/InformationRegisters/СБ_ВместимостьЯчеекПоТиповымУпаковкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СБ_ВместимостьЯчеекПоТиповымУпаковкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20260824/20260824/CommonModules/СБ_РасчетСкладскихЯчеек/Ext/Module.bsl
Функция СБ_ПроверкаВозможностиЗаполненияЯчейки(Ячейка, Тара, Количество) Экспорт 
	
	ВместимостьЯчейки = СБ_РасчетВместимостиКоличестваТарВЯчейку(Ячейка, Тара, Количество);
	Если ВместимостьЯчейки < Количество Тогда  
		ТекстСообщения = "Количество упаковок (" + Количество + ") превышает вместимость (" + ВместимостьЯчейки + ") для ячейки (" + Ячейка + ").";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
	Возврат ВместимостьЯчейки >= Количество;
	
КонецФункции

Функция СБ_РасчетВместимостиКоличестваТарВЯчейку(Ячейка, Тара, Количество) Экспорт 
	
	ЗаполненностьЯчейки = СБ_РасчетЗаполненностиЯчейки(Ячейка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СБ_ВместимостьЯчеекПоТиповымУпаковкам.Ячейка КАК Ячейка,
	|	СБ_ВместимостьЯчеекПоТиповымУпаковкам.Тара КАК Тара,
	|	СБ_ВместимостьЯчеекПоТиповымУпаковкам.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.СБ_ВместимостьЯчеекПоТиповымУпаковкам КАК СБ_ВместимостьЯчеекПоТиповымУпаковкам
	|ГДЕ
	|	СБ_ВместимостьЯчеекПоТиповымУпаковкам.Ячейка = &Ячейка
	|	И СБ_ВместимостьЯчеекПоТиповымУпаковкам.Тара = &Тара";
	
	Запрос.УстановитьПараметр("Тара", Тара);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоВЯчейку = -1;                                     
	
	Пока Выборка.Следующий() Цикл
		
		Пока ЗаполненностьЯчейки >= 0 Цикл 
			
			КоличествоВЯчейку = КоличествоВЯчейку + 1;
			
			ЗаполненностьЯчейки = ЗаполненностьЯчейки - (1 / Выборка.Количество);
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли; 
	
	Возврат ?(КоличествоВЯчейку >= 0, КоличествоВЯчейку, 0);
	
КонецФункции

Функция СБ_РасчетЗаполненностиЯчейки(Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ЕСТЬNULL(СБ_ВместимостьЯчеекПоТиповымУпаковкам.Тара, ЗНАЧЕНИЕ(Справочник.ТипоразмерыУпаковок.ПустаяСсылка)) КАК Тара,
	|	ТоварыВЯчейкахОстатки.Упаковка.Типоразмер КАК УпаковкаТипоразмер,
	|	ВЫБОР
	|		КОГДА СБ_ВместимостьЯчеекПоТиповымУпаковкам.Количество ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.ВНаличииОстаток * (1 / СБ_ВместимостьЯчеекПоТиповымУпаковкам.Количество)
	|	КОНЕЦ КАК ЗаполненностьЯчейкиТаройСуммированное
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СБ_ВместимостьЯчеекПоТиповымУпаковкам КАК СБ_ВместимостьЯчеекПоТиповымУпаковкам
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = СБ_ВместимостьЯчеекПоТиповымУпаковкам.Ячейка
	|			И ТоварыВЯчейкахОстатки.Упаковка.Типоразмер = СБ_ВместимостьЯчеекПоТиповымУпаковкам.Тара
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.Ячейка = &Ячейка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Упаковка,
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	СБ_ВместимостьЯчеекПоТиповымУпаковкам.Тара,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток,
	|	СБ_ВместимостьЯчеекПоТиповымУпаковкам.Количество,
	|	ТоварыВЯчейкахОстатки.Упаковка.Типоразмер";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Заполненность = 1;
	Пока Выборка.Следующий() Цикл
		Заполненность = Заполненность - Выборка.ЗаполненностьЯчейкиТаройСуммированное;
	КонецЦикла;	
	
	Возврат Заполненность;
КонецФункции
